app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 3 ORDER BY "todos"."created_at" DESC
---
  def index
    @todos = current_user ? current_user.todos.order(created_at: :desc) : []

SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3
SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3 AND "todos"."completed" = 1
SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3 AND "todos"."completed" = 0
---
  def stats
    user_todos = current_user ? current_user.todos : Todo.none
    total_count = user_todos.count
    completed_count = user_todos.completed.count
    pending_count = user_todos.pending.count

INSERT INTO "todos" ("title", "completed", "created_at", "updated_at", "user_id") VALUES ('오늘의 할일', 0, '2025-07-11 15:41:13.277985', '2025-07-11 15:41:13.277985', 3) RETURNING "id"
---
  def create
    @todo = current_user ? current_user.todos.build(todo_params) : Todo.new(todo_params)

    if @todo.save

UPDATE "todos" SET "completed" = 1, "updated_at" = '2025-07-12 02:22:20.756421' WHERE "todos"."id" = 5
---
  def update
    if @todo.update(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 3 AND "todos"."id" = 9 LIMIT 1
---
  def set_todo
    @todo = current_user ? current_user.todos.find(params[:id]) : Todo.find(params[:id])