app/views/users/show.html.erb

SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3
SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3 AND "todos"."completed" = 1
---
      <div style="padding: 12px; background: white; border: 1px solid #ddd; border-radius: 5px; color: #495057;">
        전체: <%= @user.todos.count %>개 |
        완료: <%= @user.todos.completed.count %>개 |