app/views/users/show.html.erb

SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3
SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3 AND "todos"."completed" = 1
---
              <div class="text-sm text-gray-700">
                <span class="font-semibold text-blue-600">전체: <%= @user.todos.count %>개</span> |
                <span class="font-semibold text-green-600">완료: <%= @user.todos.completed.count %>개</span> |

SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3
---
        </div>
        <h3 class="text-2xl font-bold text-gray-900 mb-2"><%= @user.todos.count %></h3>

SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 3 AND "todos"."completed" = 1
---
        </div>
        <h3 class="text-2xl font-bold text-gray-900 mb-2"><%= @user.todos.completed.count %></h3>