app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "crypted_password", "salt", "created_at", "updated_at") VALUES ('wjb127@naver.com', '$2a$10$E63oG4aRy.mZS3hk5/Pw1.BwdnrMuLg8ytb7M/sZJuDDCkI643gPC', 'N7q9sFH6UyJpzPfMCyTo', '2025-07-11 15:40:17.991576', '2025-07-11 15:40:17.991576') RETURNING "id"